package task3;

/**
 * @author Andrej Reutow
 * created on 01.10.2023
 * <p>
 * Создайте иерархию классов для животных, включая млекопитающих и птиц. У каждого класса будут общие атрибуты имя и место обитания, а также специфичные атрибуты: у млекопитающих - тип питания (травоядные, хищники) и количество ног, у птиц - размах крыльев и тип перьев (пушистые, пернатые).
 * <p>
 * Создайте методы для каждого класса, позволяющие животным издавать свои звуки (мяукать, гавкать, чирикать и т. д.). Также реализуйте метод, который выводит информацию о животных, включая их общие и специфичные атрибуты.
 * <p>
 * Создайте объекты разных типов животных и вызовите методы для издания звуков и вывода информации о них.
 */
public class Task3Runner {
}
